app/Controllers/Attractions.php

    public function index()
    {
        $model = new TouristCentre(); // Replace 'YourModel' with your actual model name

        // Retrieve records with visible=1 and sort by created_at in descending order
        $thumbnails = $model->select('id, name, image, created_at, image360')
            ->where('visible', 1)
            ->orderBy('created_at', 'DESC')
            ->findAll();
---
SELECT `id`, `name`, `image`, `created_at`
FROM `tourist_centres`
WHERE `visible` = 1
ORDER BY `created_at` DESC

    public function view($thumbnailId)
    {
        $model = new TouristCentre(); // Replace 'YourModel' with your actual model name

        $thumbnail = $model->find($thumbnailId);
---
SELECT *
FROM `tourist_centres`
WHERE `tourist_centres`.`id` = '2'