app/Controllers/Home.php

SELECT `id`, `name`, `image`, `created_at`, `description`
FROM `news`
WHERE `visible` = 1
ORDER BY `created_at` DESC
---
    public function index()
    {
        $model = new NewsModel(); // Replace 'YourModel' with your actual model name

        // Retrieve records with visible=1 and sort by created_at in descending order
        $thumbnails = $model->select('id, name, image, created_at, description')
            ->where('visible', 1)
            ->orderBy('created_at', 'DESC')
            ->findAll();

SELECT *
FROM `news`
WHERE `news`.`id` = '2'
---
    public function view($thumbnailId)
    {
        $model = new NewsModel(); // Replace 'YourModel' with your actual model name

        $thumbnail = $model->find($thumbnailId);