app/Controllers/NewsController.php

    public function index()
    {
        $model = new NewsModel();
        $data['news'] = $model->findAll();
---
SELECT *
FROM `news`