app/Controllers/SearchController.php

    public function results()
    {
        $query = $this->request->getGet('query');

        if (!empty($query)) {
            $foodModel = new FoodModel();
            $touristCentreModel = new TouristCentre();

            $foodResults = $foodModel->like('name', $query)->findAll();
            $touristCentreResults = $touristCentreModel->like('name', $query)->findAll();
---
SELECT *
FROM `foods`
WHERE `name` LIKE '%l%' ESCAPE '!'
SELECT *
FROM `tourist_centres`
WHERE `name` LIKE '%l%' ESCAPE '!'