app/Controllers/TouristCentreController.php

SELECT *
FROM `tourist_centres`
---
    public function index()
    {
        $model = new TouristCentre();
        $data['touristCentres'] = $model->findAll();